cases/ibm_aligned/0_org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include        "include/constantValues"

dimensions [0 2 -2 0 0 0 0];

internalField uniform 0;

boundaryField
{
    wallIB 
    {
        type immersedBoundary;
        refValue uniform 0;
        refGradient  uniform 0;
        fixesValue no;

        setDeadCellValue   yes;
        deadCellValue      0;

        value uniform 0;
    }

    lower 
    {
        type zeroGradient;
    }

    upper
    {
        type zeroGradient;
    }

    left 
    {
        type            zeroGradient;
    }
    right 
    {
		type            fixedValue;
        value           uniform 0;
    }
    front
    {
        type            $type1;
    }
    back
    {
        type            $type1;
    }

}

// ************************************************************************* //
