cases/ibm_aligned/0_org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include        "include/constantValues"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 17.64735;

boundaryField
{
    wallIB
    {
        type            immersedBoundaryWallFunction;
        patchType       immersedBoundary;
        refValue        uniform 1e-10;
        refGradient     uniform 0;
        fixesValue      false;
        setDeadCellValue yes;
        deadCellValue   1e-10;

        value           $internalField;
    }
    upper
    {
        type            zeroGradient;
    }
    lower 
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    left 
    {
        type            fixedValue;
        value           $internalField;
    }
    right 
    {
        type            zeroGradient;
    }
    front
    {
        type            $type1;
    }
    back
    {
        type            $type1;
    }

}


// ************************************************************************* //
